---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.FrictionFactor
source: html/800333d1-2378-8421-6c8e-c613c5d64454.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.FrictionFactor Property

The friction factor of the pipe.

## Syntax (C#)
```csharp
public double FrictionFactor { get; set; }
```